{"/hardware/maixface/en/mf_ml_module/mf1_ml_module.html":{"title":"MF Face recognition module MF1","content":"# MF Face recognition module MF1 ## **Modification Record** VersionTimeModified content 1.02019.07.30Initial version 1.22020.08.1 ## table of Contents [**Introduction to hardware resources**](#Introduction to hardware resources) [**Function Introduction**](#Function Introduction) [Module Features](#Module Features) [Instructions for use](#Instructions for use) [**Application plan**](#Application plan) [Serial Module](#Serial Module) <! [WeChat Mini Program Module](#微信小程序 Module) > <! [Second Development](#Second Development) > <! [**Q&A**](#qa) > ## **Introduction to Hardware Resources** <center class \"half\"> <img src \"../../assests/front.png\" width 50% /><img src \"assests/bottom.jpg\" width 50% /> </center> * CPU: **RISC V** dual core 64bit, built in FPU, frequency 400Mhz 500Mhz * Image recognition: living body recognition * Dual cameras: infrared + visible light * Infrared filling light: 3W infrared light emitting diode * Display: 1.33 inches TFT, resolution 240*320 display * Other peripherals: capacitive touch button/support 3W speaker/MEMS microphone/SD NAND/RGB LED * Wireless function (optional): Support 2.4G 802.11.b/g/n, SPI connection * [Buy on Taobao](https://item.taobao.com/item.htm?spm a1z10.1 c.w4004 21231188695.25.27ba52b1bsusf7&id 599138281058) <div STYLE \"page break after: always;\"></div> ## **Function Introduction** ![MF1 pin map](../../assets/mf_module/mf1/mf1_pin_map.png)"},"/hardware/maixface/en/mf_ml_module/mf_update_firmwave.html":{"title":"MF Firmware related upgrade instructions","content":"# MF Firmware related upgrade instructions In the process of using the **MF face recognition module**, if there is a firmware bug, a new function firmware release, a mistakenly erased firmware, font resources, and image resources, then the firmware needs to be restored by burning. ## MF face recognition module firmware, resource description **MF Face Recognition Module** The firmware, font resources, picture resources, descriptions are as follows: Type Burning Address Length Description Firmware 0x000000 Face Model Font Resources Picture Resources Board level configuration 0x7FF000 4 KB Face Information 0x800000 64 KB > After getting the MF module, the general developer does not need to care about the resource distribution MF firmware description VIS: Visible light (VIS) IR: infrared light (IR) Firmware classification Direction Protocol Identification method wechat Number of firmware types : : : : : : MF0 trial version module horizontal version, vertical version bin vis 2 MF1 offline module horizontal and vertical bin/json vis+ir 8 MF2 WeChat semi finished product Horizontal version, vertical version bin vis Support 2 MF4 WeChat (finished product) Vertical version bin vis Support 1 MF5 WeChat (finished product) Vertical version bin/json vis Support 2 Font resources Picture resources ## MF firmware burning (upgrade, restore factory configuration) steps In the process of using the **MF face recognition module**, if there is a firmware bug, a new function firmware release, a mistakenly erased firmware, font resources, and image resources, then the firmware needs to be restored by burning. ### Preparation: Before upgrading and restoring the factory configuration **MF face recognition module**, we need to prepare software and hardware. **Hardware preparation:** **MF Face Recognition Module** USB Type C data cable **Software preparation:** Burning software: kflash_gui (Kflash_gui v1.6.5 version is used here) **Download link:** Github: [kflash_gui](https://github.com/Sipeed/kflash_gui) Sipeed: [Sipeed official download site kflash_gui](https://dl.sipeed.com/MAIX/tools/kflash_gui/kflash_gui_v1.6.5) Burn resource files (burn according to the situation): **MF face recognition module firmware**, algorithm model files, font resource files, image resource files Get the resource files and send a unified email to: Email: Support@sipeed.com The recommended email format is as follows: > Problem type: [MF firmware resource acquisition] > > Use hardware/firmware version: [MF0/MF1/MF2/MF4/MF5] > > Content: [Get the latest firmware/Firmware is missing/Model is missing (describe the relevant situation)] > > Machine code: [xxxxxxxxxxxxxxxxxxxxx (only required when the model is lost)] ### Burn firmware, resource files Use the USB Type C data cable to connect the **MF face recognition module** to the computer ![MF1 connect USB](../../assets/mf_module/mf1/mf1_view.png) Open Kflash_gui, select the file to be burned, select the version (default is `automatic selection`, if the burn fails, select `MaixDuino`), select the serial port number (CH522 has two serial ports, try the other one if it fails), configure the wave Special rate (default is `150000`, if programming fails, reduce the baud rate appropriately, such as `115200`) ![image 20200806103433410](../../../en/maix/assets/kflash_gui/image 20200806103433410.png) ![image 20200806105056527](../../../en/maix/assets/kflash_gui/image 20200806105056527.png) ## How to get Key (Machine Code) During use, if the model of the module is lost or needs to be replaced, you need to send the `Key` to <Support@sipeed.com> The recommended email format is as follows: First download [key_gen.bin](https://fdvad021asfd8q.oss cn hangzhou.aliyuncs.com/Sipeed_M1/firmware/key_gen_v1.2.bin) After using the `kflash_gui` to burn the firmware `key_gen.bin` into the module, open the serial port and the baud rate is `115200,8,N,1` > **[kflash_gui](https://github.com/Sipeed/kflash_gui/releases)** is K210 firmware burning tool, source code: [**Sipeed/kflash_gui**](https://github.com/Sipeed/kflash_gui) It is recommended to use [`XCOM`](tools/XCOM_V2.2.exe) to view the serial port information Tap `DTR` and release it to reset the module and see the startup information <center class \"half\"> <img src \"../../../en/maix/assets/other/how_to_get_key.png\" height 50% width 80% /> </center> ## MF Firmware Version Description Due to the different imaging directions of the cameras, there are two firmware versions: horizontal and vertical versions; How to confirm the firmware corresponding to the camera: (identified by the camera silkscreen) Horizontal board Vertical board ![](../../assets/mf_module/mf1/mf_dual_camera_1.jpg) ![](../../assets/mf_module/mf1/mf_dual_camera_2.png) "},"/hardware/maixface/en/mf_ml_module/mf_precautions.html":{"title":"MF PCB design considerations","content":"# MF PCB design considerations Precautions: 1. For the 850nm infrared fill light, 1W or 3W power lamp beads can be considered, because the lamp beads with higher power can extend the service life, reduce the failure rate and improve the recognition effect 2. The driving circuit and component parameters of infrared lamp beads and white light lamp beads must be determined according to the actual lamp beads selection and quantity. Because the cost of different circuits is different, the brightness feels different, and the needs of different customers are different, so customers need to choose and adjust parameters according to the actual situation. 3. 850nm light has certain penetrability. It has been confirmed that the 850nm light of the infrared fill light will penetrate from the periphery and back of the camera module, affecting the imaging, and then affecting the screen image or the recognition effect. Therefore, it is necessary to use 850nm impenetrable materials/paint/tape to block the infrared light scattered from the lamp beads to the inside of the camera between the camera and the fill light. In addition, you can also open the distance between the infrared lamp beads and the camera. Keep the distance above 15mm to reduce the negative impact by 80%. Keep the distance above 20mm, and the infrared rays will not be transmitted into the camera. 4. The heat dissipation pad on the bottom of the M1/M1w module needs to be connected to the largest possible copper skin to improve the heat dissipation performance 5. The pads of white light lamp beads and infrared lamp beads need to be connected to the largest possible copper skin to improve heat dissipation performance 6. The capacitor to the ground of the white light fill light should be removed, otherwise it will reset when the light is turned on 7. If capacitive touch is needed, try to put the touch chip under the position close to the finger touch. Because of the trace length between the touch chip and the touch panel, the longer the length, the more difficult it is to grasp the sensitivity and the easier it is to be interfered. 8. For each K210 module pin and power pin used, try to add ESD diodes. The location of the ESD diode is selected according to the actual situation 9. If there is a requirement for certification, all data lines D0 D7 of the screen/camera and 4 control signals, as well as other communication signal lines, need to add RC filtering to eliminate overshoot and ringing according to the actual measurement conditions. The parameter is 100R+100PF (It is best to decide according to the actual test), low pass RC form (the signal output first passes through the resistor and then the capacitor, and the RC component is placed close to the M1 module). Try to add RC filtering to other output signals (resistance and capacitance are determined according to the actual signal frequency) 10. Try to connect 200R resistors and ESD diodes to each IO to protect the IO ports 11. The working voltage and tolerance voltage of RST, BANK6/7, camera 8 bit data and screen 8 bit data of M1/M1w module are 1.8V, and the working voltage and tolerance voltage of BANK0/1/2/3/4/5 All are 3.3V withstand voltage, and must not exceed the withstand voltage range. If you want to use the RST pin, it is recommended to use a MOS tube to form a level conversion circuit. 12. The 5V of the module is the input, and the external power supply is used for the module; the 1.8V and 3.3V of the module are generated by the internal DC DC of the module, which are mainly used for the internal core components of the module, and secondly for the small current components outside the module. (For example, as a 1.8V reference voltage for screens and cameras, and other small current requirements. It is not recommended to provide large current components outside the module) 13. If you use the M1w module, you need to follow the antenna placement principle to place the IPEX 2.4G antenna, otherwise the signal will have a greater degree of loss 14. IO16 (BOOT) needs to add a 10K pull up resistor to 3.3V on the bottom board 15. FPIOA allows users to map 255 internal functions to 48 free IOs on the periphery of the chip"},"/hardware/maixface/en/mf_ml_module/mf0_ml_module.html":{"title":"MF0 Machine Learning Core Module","content":"# MF0 Machine Learning Core Module ## Software and hardware overview MF0 face recognition module appearance at a glance <table border \"3\"> <tr> <th colspan 3>MF0</th> </tr> <tr> <td width \"100\">Description</td> <td>Front view</td> <td>Back view</td> </tr> <tr> <td width \"100\">MF0</td> <td> <img src \"../../assets/mf_module/mf0_mf0dock/mf0_pin_map.png\" width \"600\" alt \"MF0 front\"> Pin Map</br> </td> <td> <img src \"../../assets/mf_module/mf0_mf0dock/mf0_buttom.png\" width \"600\" alt \"MF0 back view\"> </td> </tr> <tr> <td>MF0 Dock</td> <td> <! <img src \"../assets/mf_module/mf1_bottom_v2(nand).png\" width \"600\" alt \"MF1(NAND Flash) back view\"> > </td> <td> </td> </tr> </table> ### Module features: CPU: RISC V 64bit dual core processor, 400Mhz standard frequency (overclockable) Image recognition: QVGA@60FPS/VGA@30FPS Deep learning framework: TensorFlow/Keras/Darknet Peripherals: FPIOA, UART, GPIO, SPI, I²C, I²S, WDT, TIMER, etc 2.54mm pitch DIP/SMT pad Can be connected to a breadboard Onboard camera connector ROM: 4MByte RAM: 6MByte (General purpose) + 2MByte (KPU dedicated) ### Hardware pin No. Description 24 User IO24 25 User IO25 26 User IO26, MF0_Dock(LCD_RST) 27 User IO27, MF0_Dock(LCD_CLK) 28 User IO28, MF0_Dock(LCD_DC) 29 User IO29, MF0_Dock(LCD_SDA) BOOT Power on boot mode selection (user IO16, not recommended for users) IO5 User IO5 (ISP_TX) IO4 User IO4 (ISP_RX) EN MF0 power enable pin, default high level enable RST K210 reset pin VIN External power supply 3.4 5.9V (5.0V recommended) GND External power supply ground 3V3 Module power supply 3.3V output ## Agreement Serial port protocol: MFO burns HEX protocol firmware by default MF0 has two protocol firmware, which is convenient for users to use according to specific needs HEX format serial protocol firmware JSON format serial protocol firmware HEX example ### Serial Protocol Assistant ## Update MF0 firmware MF0 hardware connection: No. USB to serial port module MF0 IO Remarks 1 5V VIN 2 GND GND 3 TX IO4 4 RX IO5 5 DTR BOOT 6 RTS RST ![](../../assets/mf_module/mf0_mf0dock/mf0_flash.png) MF0 Dock hardware connection: After connecting according to the following table, when downloading using kflash_gui, you need to press the boot and rst buttons, and release the rst and then the boot button to ensure that the K210 enters the download mode (ISP mode) No. USB to serial port module MF0 Dock IO Remarks 1 5V VIN 2 GND GND 3 TX IO4 4 RX IO5 ![](../../assets/mf_module/mf0_mf0dock/mf0_dock_flash.png) Then use kflash_gui to download the MF0 firmware ![](../../assets/mf_module/mf0_mf0dock/mf0_upgrade_firmwave.png)"},"/hardware/maixface/en/core_modules/k210_core_modules.html":{"title":"K210 core module","content":"# K210 core module There are four AIOT modules developed based on K210: M1, M1w, M1n, MF0 Feature description: These four modules are based on Canaan Kanzhi Technology's edge intelligent computing chip K210 (RISC V architecture). The main control chip has a built in 64 bit dual core high performance low power processor, each core has a floating point unit (FPU), a convolutional artificial neural network intelligent hardware accelerator (KPU) and a fast Fourier transform accelerator (FFT) , Equipped with Field Programmable IO Array (FPIOA), supports a variety of mainstream AI programming frameworks. ### Maix AIOT module difference comparison M1 M1w M1n MF0 Exterior ![M1 module](../../assets/mf_module/m1_m1w/sipeed_m1_module.png) ![M1W module](../../assets/mf_module/m1_m1w/sipeed_m1w_module.png) ![M1n module](../../assets/mf_module/m1n/sipeed_m1n_module.png) ![MF0 module](../../assets/mf_module/mf0_mf0dock/sipeed_mf0_module.png) size 25.4x25.4x3.3（mm） 25.4x25.4x3.3（mm） 25.0x22.0x2.7（mm） 20.0x20.0x4.5（mm） Voltage output (provided to the bottom board) 1.8V and 3.3V 1.8V and 3.3V 1.8V and 3.3V 3.3V Maximum power consumption (non transient) 1.5W 3W 1.5W 1.5W WIFI None K210 and ESP8285 are connected through SPI interface and serial port None None Onboard camera connector None None Yes (only compatible with single camera) Yes (only compatible with single camera) Pin form Stamp hole Stamp hole NGFF B KEY 2.54mm pitch through pad + SMD pad camera signal All leads All leads All leads None screen signal All leads All leads All leads None Lead out ordinary IO port Quantity 48 (all lead out) Quantity 48 (all lead out) 44 (not drawn by IO0 3) 9 ## Module pin definition Specific downloadable specifications M1/M1w: https://dl.sipeed.com/MAIX/HDK/Sipeed M1&M1W/Specifications M1n: https://dl.sipeed.com/MAIX/HDK/Sipeed M1n MF0: https://dl.sipeed.com/MAIX/HDK/Sipeed MF0/MF0 2802"},"/hardware/maixface/en/index.html":{"title":"Sipeed Hardware","content":" title: Sipeed Hardware keywords: Sipeed, Hardware, 矽速, 硬件资料, 文档, 资料下载 desc: 矽速科技的硬件资料站 # Sipeed HardWare WIKI [[English](./README_en.html)中文] ## K210 核心模组 * [K210 核心模块](./core_modules/k210_core_modules.html) [M1/M1w](./core_modules/k210_core_modules.html) [M1n](./core_modules/k210_core_modules.html) ## MF 人脸识别模块 > MF 系列产品面向于商业开发应用 * [MF 人脸识别模块](./) [MF0&&MF0 Dock](./mf_ml_module/mf0_ml_module.html) [MF1 && MF2](./mf_ml_module/mf1_ml_module.html) [MF4 && MF5](./mf_ml_module/mf5_product.html) [MF 人脸识别模块 PCB 设计注意事项](./mf_ml_module/mf_precautions.html) [MF 更新固件说明](./mf_ml_module/mf_update_firmwave.html)"},"/hardware/maixface/en/no_translate.html":{"title":"no translation","content":" title: no translation class: md_page <div id \"visit_from\"></div> <div id \"no_translate_hint\">This page not translated yet</div> <div> <span id \"visit_hint\">Please visit</span> <a id \"translate_src\"></a> </div> <div> <script> function getQueryVariable(variable) { var query window.location.search.substring(1); var vars query.split(\"&\"); for (var i 0;i<vars.length;i++) { var pair vars[i].split(\" \"); if(pair[0] variable){return pair[1];} } return(false); } var ref getQueryVariable(\"ref\"); var from getQueryVariable(\"from\"); var link document.getElementById(\"translate_src\"); var fromDis document.getElementById(\"visit_from\"); link.href ref; link.text ref; fromDis.innerHTML from; </script> </div>"}}